//DB2GRANT JOB MSGCLASS=H,CLASS=A,NOTIFY=&SYSUID,REGION=0M
//BIND EXEC PGM=IKJEFT01,DYNAMNBR=20
//STEPLIB  DD DSN=DSN1210.DB2.SDSNEXIT,DISP=SHR
//         DD DSN=DSN1210.DB2.SDSNLOAD,DISP=SHR
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSTSIN  DD *
DSN SYSTEM(DSN2)
RUN PROGRAM(DSNTIAD) PLAN(DSNTIA12)  -
     LIB('DSN2.RUNLIB.LOAD')
//SYSIN  DD *
 grant execute on package "zCEEService"."*" to USER2;
 grant execute on package SYSIBMSERVICE."*" to USER2;
/*
