//JWTDIGTR JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,REGION=0M
//RACF EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
 RACDCERT REMOVE(CERTAUTH +
   LABEL('OpenIdProv-CertAuth') RING(zCEE.KeyRing)) ID(LIBSERV)

 RACDCERT REMOVE(CERTAUTH +
   LABEL('ATS Liberty CA') RING(zCEE.KeyRing)) ID(LIBSERV)

 RACDCERT REMOVE(CERTAUTH +
   LABEL('zCEE-CertAuth') RING(zCEE.KeyRing)) ID(LIBSERV)

 RACDCERT REMOVE(CERTAUTH +
   LABEL('OpenIdProv-CertAuth') RING(zCEE.Server.KeyRing)) ID(ATSSERV)

 RACDCERT REMOVE(CERTAUTH +
   LABEL('RPServer-CertAuth') RING(zCEE.Server.KeyRing)) ID(ATSSERV)

 RACDCERT REMOVE(CERTAUTH +
   LABEL('OpenIdProv-CertAuth') RING(zCEE.KeyRing)) ID(ATSSERV)

setropts raclist(digtring) refresh
