//JWTRACMP JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,REGION=0M              JOB19642
//RACF EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
 RACMAP DELMAP(LABEL('zCEE JWT FRED')) ID(FRED)
 RACMAP DELMAP(LABEL('zCEE JWT USER1')) ID(USER1)
 RACMAP DELMAP(LABEL('zCEE JWT USER2')) ID(USER2)

 RACMAP ID(FRED)  MAP USERDIDFILTER(NAME('Fred')) +
   REGISTRY(NAME('*')) WITHLABEL('zCEE JWT FRED')
 RACMAP ID(USER1)  MAP USERDIDFILTER(NAME('distuser1')) +
   REGISTRY(NAME('*')) WITHLABEL('zCEE JWT distuser1')
 RACMAP ID(USER2)  MAP USERDIDFILTER(NAME('distuser2')) +
   REGISTRY(NAME('*')) WITHLABEL('zCEE JWT distuser2')

 SETROPTS RACLIST(IDIDMAP) REFRESH

 RACMAP ID(FRED) LISTMAP
 RACMAP ID(USER1) LISTMAP
 RACMAP ID(USER2) LISTMAP
