        01 RESPONSE-DATA.
           10 stat             PIC X.
           10 numb             PIC X(6).
           10 name             PIC X(20).
           10 addrx            PIC X(20).
           10 phone            PIC X(8).
           10 datex            PIC X(8).
           10 amount           PIC X(8).
           10 comment          PIC X(9).
           10 vsam-status-code PIC X(2).
           10 results-message  PIC X(20).
