//JOHNSONS JOB MSGCLASS=H,NOTIFY=&SYSUID
//* JCLLIB ORDER=SYS1.ECOBOL.SIGYPROC
// SET PROGNAME=ZCEECICS
//*SET PROGNAME=ZCEEPLPI
//COMPILE EXEC IGYWCL,LNGPRFX=SYS1.ECOBOL,
// PARM.COBOL='NODYNAM,CICS'
//COBOL.STEPLIB DD
//             DD DISP=SHR,DSN=CICSTS53.CICS.SDFHLOAD
//COBOL.SYSIN  DD DISP=SHR,DSN=JOHNSON.ZCEE.SOURCE(&PROGNAME)
//COBOL.SYSLIB DD DISP=SHR,DSN=JOHNSON.ZCEE.MAPS
//             DD DISP=SHR,DSN=JOHNSON.ZCEE.SOURCE
//             DD DISP=SHR,DSN=CICSTS52.CICS.SDFHCOB
//LKED.SYSLMOD DD DISP=SHR,DSN=JOHNSON.ZCEE.LOADLIB(&PROGNAME)
//LKED.CICSLIB DD DISP=SHR,DSN=CICSTS53.CICS.SDFHLOAD
//LKED.SYSIN   DD *
 INCLUDE CICSLIB(DFHELII)
