        01 REQUEST-DATA.
               10  request-type PIC X(1).
               10  stat         PIC X.
               10  numb         PIC X(6).
               10  name         PIC X(20).
               10  addrx        PIC X(20).
               10  phone        PIC X(8).
               10  datex        PIC X(8).
               10  amount       PIC X(8).
               10  comment      PIC X(9).
               10  filler       PIC X(21).
