//ZCEERACF JOB (0),'RACF',CLASS=A,REGION=0M,
//             MSGCLASS=H,NOTIFY=&SYSUID
//*---------------------------------------------------------*/
//*   DEFINE UNAUTHENTICATED USER, APPL and EJBROLE         */
//*---------------------------------------------------------*/
//RACF     EXEC PGM=IKJEFT01,REGION=0M
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *

ADDUSER USER10 DFLTGRP(SYS1) OMVS(AUTOUID -
  HOME(/u/user10) PROGRAM(/bin/sh))
ADDUSER USER11 DFLTGRP(SYS1) OMVS(AUTOUID -
  HOME(/u/user11) PROGRAM(/bin/sh))
ADDUSER USER12 DFLTGRP(SYS1) OMVS(AUTOUID -
  HOME(/u/user12) PROGRAM(/bin/sh))
ADDUSER USER13 DFLTGRP(SYS1) OMVS(AUTOUID -
  HOME(/u/user13) PROGRAM(/bin/sh))
ADDUSER USER20 DFLTGRP(SYS1) OMVS(AUTOUID -
  HOME(/u/user20) PROGRAM(/bin/sh))
ADDUSER USER21 DFLTGRP(SYS1) OMVS(AUTOUID -
  HOME(/u/user21) PROGRAM(/bin/sh))
ADDUSER USER22 DFLTGRP(SYS1) OMVS(AUTOUID -
  HOME(/u/user22) PROGRAM(/bin/sh))
ADDUSER USER23 DFLTGRP(SYS1) OMVS(AUTOUID -
  HOME(/u/user23) PROGRAM(/bin/sh))
ADDUSER USER24 DFLTGRP(SYS1) OMVS(AUTOUID -
  HOME(/u/user24) PROGRAM(/bin/sh))
ADDUSER USER30 DFLTGRP(SYS1) OMVS(AUTOUID -
  HOME(/u/user30) PROGRAM(/bin/sh))
ADDUSER USER31 DFLTGRP(SYS1) OMVS(AUTOUID -
  HOME(/u/user30) PROGRAM(/bin/sh))
ADDUSER USER32 DFLTGRP(SYS1) OMVS(AUTOUID -
  HOME(/u/user32) PROGRAM(/bin/sh))
ADDUSER USER34 DFLTGRP(SYS1) OMVS(AUTOUID -
  HOME(/u/user34) PROGRAM(/bin/sh))

ALTUSER USER11 password(user11) noexpire
ALTUSER USER12 password(user12) noexpire
ALTUSER USER13 password(user13) noexpire
ALTUSER USER14 password(user14) noexpire
ALTUSER USER21 password(user21) noexpire
ALTUSER USER22 password(user22) noexpire
ALTUSER USER23 password(user23) noexpire
ALTUSER USER24 password(user24) noexpire
ALTUSER USER31 password(user31) noexpire
ALTUSER USER32 password(user32) noexpire
ALTUSER USER33 password(user32) noexpire
ALTUSER USER34 password(user34) noexpire

ADDGROUP CSCADMIN OMVS(AUTOGID)
ADDGROUP CSCOPERS OMVS(AUTOGID)
ADDGROUP CSCINVKE OMVS(AUTOGID)
ADDGROUP CSCREADR OMVS(AUTOGID)
ADDGROUP DB2ADMIN OMVS(AUTOGID)
ADDGROUP DB2OPERS OMVS(AUTOGID)
ADDGROUP DB2INVKE OMVS(AUTOGID)
ADDGROUP DB2READR OMVS(AUTOGID)

CONNECT  USER11  GROUP(ZCEEUSRS)
CONNECT  USER12  GROUP(ZCEEUSRS)
CONNECT  USER13  GROUP(ZCEEUSRS)
CONNECT  USER14  GROUP(ZCEEUSRS)
CONNECT  USER21  GROUP(ZCEEUSRS)
CONNECT  USER22  GROUP(ZCEEUSRS)
CONNECT  USER23  GROUP(ZCEEUSRS)
CONNECT  USER24  GROUP(ZCEEUSRS)
CONNECT  USER31  GROUP(ZCEEUSRS)
CONNECT  USER32  GROUP(ZCEEUSRS)
CONNECT  USER33  GROUP(ZCEEUSRS)
CONNECT  USER34  GROUP(ZCEEUSRS)
CONNECT  USER11  GROUP(GMADMIN)
CONNECT  USER12  GROUP(GMOPERS)
CONNECT  USER13  GROUP(GMINVOKE)
CONNECT  USER14  GROUP(GMREADER)
CONNECT  USER21  GROUP(CSCADMIN)
CONNECT  USER22  GROUP(CSCOPERS)
CONNECT  USER23  GROUP(CSCINVKE)
CONNECT  USER24  GROUP(CSCREADR)
CONNECT  USER31  GROUP(DB2ADMIN)
CONNECT  USER32  GROUP(DB2OPERS)
CONNECT  USER33  GROUP(DB2INVKE)
CONNECT  USER34  GROUP(DB2READR)

/*
