//USER1S JOB MSGCLASS=H,NOTIFY=&SYSUID
//* JCLLIB ORDER=IGY630.SIGYPROC
//COMPILE EXEC IGYWCL,LNGPRFX=IGY630,PARM.COBOL='NODYNAM'
//COBOL.SYSIN  DD DISP=SHR,DSN=USER1.ZCEE30.SOURCE(GETAPIPT)
//COBOL.SYSLIB DD DISP=SHR,DSN=USER1.ZCEE30.SOURCE
//             DD DISP=SHR,DSN=ZCEE30.SBAQCOB
//             DD DISP=SHR,DSN=CEE.SCEESAMP
//LKED.SYSLMOD DD DISP=SHR,DSN=USER1.ZCEE30.LOADLIB(GETAPIPT)
