//USER1S JOB (ACCOUNT),JOHNSON,NOTIFY=&SYSUID,REGION=0M,
// CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//S1      EXEC PGM=QLOAD,PARM='-mQMZ1 -o ZCONN2.DEFAULT.MQZCEE.QUEUE   +
//             -F"DD:HERE"'
//STEPLIB  DD  DSN=MQ930.SCSQANLE,DISP=SHR
//         DD  DSN=MQ930.SCSQAUTH,DISP=SHR
//         DD  DSN=MQ930.SCSQLOAD,DISP=SHR
//SYSOUT   DD  SYSOUT=*
//HERE     DD  DISP=SHR,DSN=USER1.DFHFILEA.QLOD.UNLOAD
