//JOHNSON2 JOB 'JWT CERTS',CLASS=A,MSGCLASS=H,                          JOB19642
// NOTIFY=&SYSUID,TIME=1440,REGION=0M
//GO EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *

 RACMAP DELMAP(LABEL('zCEE JWT Distributed User1')) ID(USER1)
 RACMAP DELMAP(LABEL('zCEE JWT Distributed User2')) ID(USER2)

 RACMAP ID(USER1)  MAP USERDIDFILTER(NAME('distuser1')) +
 REGISTRY(NAME('*')) WITHLABEL('zCEE JWT Distributed User1')
 RACMAP ID(USER2)  MAP USERDIDFILTER(NAME('distuser2')) +
 REGISTRY(NAME('*')) WITHLABEL('zCEE JWT Distributed User2')

 SETROPTS RACLIST(IDIDMAP) REFRESH

 RACMAP ID(USER1) LISTMAP(LABEL('zCEE JWT Distributed User1')
 RACMAP ID(USER2) LISTMAP(LABEL('zCEE JWT Distributed User2')

 RACMAP QUERY USERDIDFILTER(NAME('distuser1')) REGISTRY(NAME('*'))
 RACMAP QUERY USERDIDFILTER(NAME('distuser2')) REGISTRY(NAME('*'))

 PERMIT ATSZDFLT CLASS(APPL) ACCESS(READ) ID(USER1)
 PERMIT ATSZDFLT CLASS(APPL) ACCESS(READ) ID(USER2)

 SETROPTS RACLIST(APPL) REFRESH

 PERMIT ATSZDFLT.zos.connect.access.roles.zosConnectAccess +
        Class(EJBROLE) +
        Id(USER1) Access(Read)

 SETROPTS RACLIST(EJBROLE) REFRESH

 Permit CSMI Class(TCICSTRN) Id(ZCGUEST) Access(Read)

 RDefine TCICSTRN ZJWT UACC(None)

 Permit ZJWT Class(TCICSTRN) Id(CICSUSER) Access(Read)

 Permit ZJWT Class(TCICSTRN) Id(ZCGUEST) Access(Read)

 SETROPTS RACLIST(TCICSTRN) REFRESH
