//BAQSMFP JOB (0),MSGCLASS=X,CLASS=A,NOTIFY=&SYSUID,REGION=0M
// SET LOADLIB=USER1.ZCEE30.LOADLIB
// SET SOURCE=ZCEE30.SBAQSAMP
// SET OBJECT=USER1.ZCEE30.OBJDSET
// SET LIBPRFX=CEE
// SET SMFPDS=JOHNSON.ZCEE.SMFDUMP1
// SET SMFSDS=JOHNSON.ZCEE.SMFDUMP2
//*
//* COMPILE THE SAMPLE SOURCE
//*
//JOBLIB JCLLIB ORDER=(SYS1.COMBINED.PROCLIB)
//COMPILE  EXEC PROC=EDCQCB,
//       LIBPRFX=&LIBPRFX,
//       CPARM='OPTFILE(DD:SYSOPTF)',
// BPARM='SIZE=(900K,124K),RENT,LIST,RMODE=ANY'
//COMPILE.SYSLIB DD DISP=SHR,DSN=&LIBPRFX..SCEEH.SYS.H
//               DD DISP=SHR,DSN=&LIBPRFX..SCEEH.H
//               DD DISP=SHR,DSN=&SOURCE
//COMPILE.SYSIN  DD DSN=&SOURCE(BAQSMFPC),DISP=SHR
//COMPILE.SYSLIN DD DISP=(SHR,KEEP),DSN=&OBJECT(BAQSMFPC)
//COMPILE.SYS    DD DISP=SHR,DSN=&LIBPRFX..SCEEH.SYS.H
//COMPILE.SYSOPTF DD *
 INFO RENT LP64 WARN64 LO SOURCE LIST
 NOMARGINS EXPMAC SHOWINC XREF
 LANGLVL(EXTENDED) SSCOM DLL
 DEFINE(_ALL_SOURCE)
/*
//*
//* BIND THE SAMPLE MODULE
//*
//BIND.SYSLMOD DD DISP=SHR,DSN=&LOADLIB.
//BIND.SYSLIB  DD DISP=SHR,DSN=&LIBPRFX..SCEEBND2
//             DD DISP=(SHR,KEEP),DSN=&OBJECT
//BIND.SYSLIN  DD  DSN=&LIBPRFX..SCEELIB(CELQS003),DISP=SHR
//BIND.SYSIN DD *
  ENTRY CELQSTRT
  INCLUDE SYSLIB(BAQSMFPC)
  NAME  BAQSMFP(R)
//*
