//USER1PA JOB (ACCOUNT),USER1,NOTIFY=&SYSUID,REGION=5M,
// CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//PASEARCH EXEC PGM=BPXBATCH,REGION=8M
//STDOUT  DD PATH='/tmp/paStd.out',
//           PATHOPTS=(OWRONLY,OCREAT),PATHMODE=SIRWXU
//STDERR  DD PATH='/tmp/paStd.err',
//           PATHOPTS=(OWRONLY,OCREAT),PATHMODE=SIRWXU
//STDPARM DD *
SH echo pasearch  -t | su
//COPY   EXEC PGM=IKJEFT01,DYNAMNBR=300
//SYSTSPRT DD SYSOUT=*
//PASTDOUT DD PATH='/tmp/paStd.out',PATHDISP=(DELETE,DELETE)
//PASTDERR DD PATH='/tmp/paStd.err',PATHDISP=(DELETE,DELETE)
//STDOUT   DD SYSOUT=*,DCB=(LRECL=1000,RECFM=V)
//STDERR   DD SYSOUT=*,DCB=(LRECL=1000,RECFM=V)
//SYSPRINT DD SYSOUT=*
//SYSTSIN  DD *
 OCOPY INDD(PASTDERR) OUTDD(STDERR)
 OCOPY INDD(PASTDOUT) OUTDD(STDOUT)
