//USER1S JOB MSGCLASS=H,NOTIFY=&SYSUID
//* JCLLIB ORDER=SYS1.ECOBOL.SIGYPROC
//COMPILE EXEC IGYWCL,LNGPRFX=SYS1.ECOBOL,PARM.COBOL='NODYNAM'
//COBOL.SYSIN  DD DISP=SHR,DSN=USER1.ZCEE30.SOURCE(GETAPIPT)
//COBOL.SYSLIB DD DISP=SHR,DSN=USER1.ZCEE30.SOURCE
//             DD DISP=SHR,DSN=ZCEE30.SBAQCOB
//             DD DISP=SHR,DSN=SYS1.LEMVS.SCEESAMP
//LKED.SYSLMOD DD DISP=SHR,DSN=USER1.ZCEE30.LOADLIB(GETAPIPT)
