//USER1S JOB (ACCOUNT),USER1,NOTIFY=&SYSUID,REGION=0M,
// CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//COMPILE EXEC IGYWCL,LNGPRFX=SYS1.ECOBOL,PARM.COBOL='NODYNAM'
//COBOL.SYSIN  DD DISP=SHR,DSN=USER1.ZCEE30.SOURCE(CSCVGETI)
//COBOL.SYSLIB DD DISP=SHR,DSN=USER1.ZCEE.SOURCE
//             DD DISP=SHR,DSN=USER1.ZCEE30.SOURCE
//             DD DISP=SHR,DSN=ZCEE30.SBAQCOB
//             DD DISP=SHR,DSN=SYS1.LEMVS.SCEESAMP
//LKED.SYSLMOD DD DISP=SHR,DSN=USER1.ZCEE.PGMLIB(CSCVGETI)
//RESLIB   DD DSN=DFSF10.SDFSRESL,DISP=SHR
//SYSIN    DD *
 INCLUDE RESLIB(DFSLI000)
 NAME  CSCVGETI(R)
//COMPILE EXEC IGYWCL,LNGPRFX=SYS1.ECOBOL,PARM.COBOL='NODYNAM'
//COBOL.SYSIN  DD DISP=SHR,DSN=USER1.ZCEE30.SOURCE(CSCVDLTI)
//COBOL.SYSLIB DD DISP=SHR,DSN=USER1.ZCEE.SOURCE
//             DD DISP=SHR,DSN=USER1.ZCEE30.SOURCE
//             DD DISP=SHR,DSN=ZCEE30.SBAQCOB
//LKED.SYSLMOD DD DISP=SHR,DSN=USER1.ZCEE.PGMLIB(CSCVDLTI)
//RESLIB   DD DSN=DFSF10.SDFSRESL,DISP=SHR
//SYSIN    DD *
 INCLUDE RESLIB(DFSLI000)
 NAME  CSCVDLTI(R)
//COMPILE EXEC IGYWCL,LNGPRFX=SYS1.ECOBOL,PARM.COBOL='NODYNAM'
//COBOL.SYSIN  DD DISP=SHR,DSN=USER1.ZCEE30.SOURCE(CSCVPSTI)
//COBOL.SYSLIB DD DISP=SHR,DSN=USER1.ZCEE.SOURCE
//             DD DISP=SHR,DSN=USER1.ZCEE30.SOURCE
//             DD DISP=SHR,DSN=ZCEE30.SBAQCOB
//LKED.SYSLMOD DD DISP=SHR,DSN=USER1.ZCEE.PGMLIB(CSCVPSTI)
//RESLIB   DD DSN=DFSF10.SDFSRESL,DISP=SHR
//SYSIN    DD *
 INCLUDE RESLIB(DFSLI000)
 NAME  CSCVPSTI(R)
//COMPILE EXEC IGYWCL,LNGPRFX=SYS1.ECOBOL,PARM.COBOL='NODYNAM'
//COBOL.SYSIN  DD DISP=SHR,DSN=USER1.ZCEE.SOURCE(CSCVPUTI)
//COBOL.SYSLIB DD DISP=SHR,DSN=USER1.ZCEE.SOURCE
//             DD DISP=SHR,DSN=USER1.ZCEE30.SOURCE
//             DD DISP=SHR,DSN=ZCEE30.SBAQCOB
//LKED.SYSLMOD DD DISP=SHR,DSN=USER1.ZCEE.PGMLIB(CSCVPUTI)
//RESLIB   DD DSN=DFSF10.SDFSRESL,DISP=SHR
//SYSIN    DD *
 INCLUDE RESLIB(DFSLI000)
 NAME  CSCVPUTI(R)
