//USER1S JOB (ACCOUNT),JOHNSON,NOTIFY=&SYSUID,REGION=0M,
// CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//S1      EXEC PGM=QLOAD,PARM='-mZMQ1 -o ZCEE.DEFAULT.MQZCEE.QUEUE     +
//             -F"DD:HERE"'
//STEPLIB  DD  DSN=MQ92#.SCSQANLE,DISP=SHR
//         DD  DSN=MQ92#.SCSQAUTH,DISP=SHR
//         DD  DSN=MQ92#.SCSQLOAD,DISP=SHR
//SYSOUT   DD  SYSOUT=*
//HERE     DD  DISP=SHR,DSN=USER1.DFHFILEA.QLOD.UNLOAD
