//JWTDIGTR JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,REGION=0M              JOB19642
//RACF EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
 RACDCERT ID(LIBSERV) CONNECT +
 ( LABEL('OpenIdProv-CertAuth') RING(zCEE.KeyRing) CERTAUTH)

 RACDCERT ID(LIBSERV) CONNECT +
 ( LABEL('zCEE-CertAuth') RING(zCEE.KeyRing) CERTAUTH)

 RACDCERT ID(ATSSERV) CONNECT +
 ( LABEL('OpenIdProv-CertAuth') RING(zCEE.KeyRing) CERTAUTH)

 SETR RACLIST(digtring) REFRESH
